#### SYNTHESIS #####

source .synopsys_dc.setup

#  READING VHDL SOURCE FILES 
analyze -f vhdl -lib WORK ../src/constants.vhd
analyze -f vhdl -lib WORK ../src/FF.vhd
analyze -f vhdl -lib WORK ../src/mux2to1.vhd
analyze -f vhdl -lib WORK ../src/reg.vhd
analyze -f vhdl -lib WORK ../src/FIR_adv_alternative.vhd 
set power_preserve_rtl_hier_names true
elaborate myfir_adv -arch beh -lib WORK

# APPLYING CONSTRAINTS
create_clock -name MY_CLK -period 0.0 CLK
set_dont_touch_network MY_CLK
set_clock_uncertainty 0.07 [get_clocks MY_CLK]
set_input_delay 0.5 -max -clock MY_CLK [remove_from_collection [all_inputs] CLK]
set_output_delay 0.5 -max -clock MY_CLK [all_outputs]
set OLOAD [load_of NangateOpenCellLibrary/BUF_X4/A]
set_load $OLOAD [all_outputs]

# START THE SYNTHESIS
compile

# SAVE THE RESULTS
report_timing > report_timing_adv_zero.txt
